run_cases/case04_singleGaussianWaveWithShock/constant/linearZone/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/linearZone/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    left
    {
        type            patch;
        nFaces          1;
        startFace       399;
    }
    right
    {
        type            patch;
        nFaces          1;
        startFace       400;
    }
    top
    {
        type            empty;
        inGroups        1(empty);
        nFaces          400;
        startFace       401;
    }
    bottom
    {
        type            empty;
        inGroups        1(empty);
        nFaces          400;
        startFace       801;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          400;
        startFace       1201;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          400;
        startFace       1601;
    }
)

// ************************************************************************* //
