run_cases/case04_singleGaussianWaveWithShock/system/linearZone/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/linearZone";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

spatialScheme		DRP7;

filterScheme		SFo9p 0e-3;

temporalScheme		LDDRK46;

interfaceInterpolation
{
	patches		(interfaceL interfaceR);
	order		0;
	relax		0;
}

divSchemes
{
	default			Gauss linear;
}

gradSchemes
{
	default			Gauss linear;
}

laplacianSchemes
{
    default			Gauss linear corrected;
}

// ************************************************************************* //
