run_cases/case04_singleGaussianWaveWithShock/system/nonLinearZone/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/nonLinearZone";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
	defualt			Euler;
}

divSchemes
{
	default			Gauss linear;
}

gradSchemes
{
	default			Gauss linear;
	limited			cellLimited Gauss linear 1.0;
}

laplacianSchemes
{
    default			Gauss linear corrected;
}

interpolationSchemes
{
	default				linear;
	reconstruct(rho)	vanLeer;
	reconstruct(U)		vanLeerV;
	reconstruct(p)		vanLeer;
}

// ************************************************************************* //
